In [2]:
import pandas as pd
import numpy as np

**Question 1**

In [2]:
number_of_students = 15

In [3]:
# Create data dictionary
data = {'Id': np.arange(1, number_of_students+1).tolist(),
        'height': [159, 164, 198, 152, 158, 157, 160, 185,
                   158, 178, 174, 174, 163, 153, 184]}

In [4]:
# Transform dictionary into a data frame
df = pd.DataFrame(data)
 
df

    Id  height
0    1     159
1    2     164
2    3     198
3    4     152
4    5     158
5    6     157
6    7     160
7    8     185
8    9     158
9   10     178
10  11     174
11  12     174
12  13     163
13  14     153
14  15     184

In [5]:
# Define systematic sampling function
def systematic_sampling(df, step):
 
    indexes = np.arange(0, len(df), step=step)
    systematic_sample = df.iloc[indexes]
    return systematic_sample

In [6]:
# Obtain a systematic sample and save it in a new variable
systematic_sample = systematic_sampling(df, 3)

In [7]:
systematic_sample

    Id  height
0    1     159
3    4     152
6    7     160
9   10     178
12  13     163

In [8]:
#Save the obtained systematic sample
systematic_sample = systematic_sampling(df, 5)

In [9]:
systematic_sample

    Id  height
0    1     159
5    6     157
10  11     174

**Stratified Sampling**

In [10]:
# Create a dictionary of students
students = {
    'Name': ['Alan', 'Harry', 'Rohan', 'Raj', 'Vicky',
             'Eden', 'Virat', 'Harsh', 'Sameer', 'Ashwin'],
    'ID': ['001', '002', '003', '004', '005', '006', 
           '007', '008', '009', '010'],
    'Grade': ['A', 'B', 'B', 'C', 'B', 'C', 'C', 
              'A', 'B', 'B'],
    
    'Category': [2, 3, 1, 2, 3, 3, 2, 1, 2, 1]
}
  
# Create dataframe from students dictionary
df = pd.DataFrame(students)
  
# view the dataframe
df

     Name   ID Grade  Category
0    Alan  001     A         2
1   Harry  002     B         3
2   Rohan  003     B         1
3     Raj  004     C         2
4   Vicky  005     B         3
5    Eden  006     C         3
6   Virat  007     C         2
7   Harsh  008     A         1
8  Sameer  009     B         2
9  Ashwin  010     B         1

In [11]:
# A sample of 6 students disproportionately is Created 
df.groupby('Grade', group_keys=False).apply(lambda x: x.sample(2))

     Name   ID Grade  Category
0    Alan  001     A         2
7   Harsh  008     A         1
1   Harry  002     B         3
8  Sameer  009     B         2
5    Eden  006     C         3
6   Virat  007     C         2

In [12]:
df.groupby('Grade', group_keys=False).apply(lambda x: x.sample(frac=0.6))

     Name   ID Grade  Category
7   Harsh  008     A         1
8  Sameer  009     B         2
9  Ashwin  010     B         1
4   Vicky  005     B         3
3     Raj  004     C         2
6   Virat  007     C         2

**CLUSTERING SAMPLE**

In [13]:
#make this example reproducible
np.random.seed(0)

#create DataFrame
df = pd.DataFrame({'tour': np.repeat(np.arange(1,11), 20),
                   'experience': np.random.normal(loc=7, scale=1, size=200)})


df

     tour  experience
0       1    8.764052
1       1    7.400157
2       1    7.978738
3       1    9.240893
4       1    8.867558
..    ...         ...
195    10    6.828454
196    10    7.771791
197    10    7.823504
198    10    9.163236
199    10    8.336528

[200 rows x 2 columns]

In [14]:
#randomly choose 4 tour groups out of the 10
clusters = np.random.choice(np.arange(1,11), size=4, replace=False)

#define sample as all members who belong to one of the 4 tour groups
cluster_sample = df[df['tour'].isin(clusters)]

#view first six rows of sample
cluster_sample

     tour  experience
0       1    8.764052
1       1    7.400157
2       1    7.978738
3       1    9.240893
4       1    8.867558
..    ...         ...
195    10    6.828454
196    10    7.771791
197    10    7.823504
198    10    9.163236
199    10    8.336528

[80 rows x 2 columns]

In [15]:
#find how many observations came from each tour group
cluster_sample['tour'].value_counts()

1     20
6     20
8     20
10    20
Name: tour, dtype: int64

**QUESTION 2**

In [5]:
data = pd.read_csv('../Dataset/Titanic.csv')
data.head(7)

,Name,PClass,Age,Sex,Survived
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0
4,"Allison, Master Hudson Trevor",1st,0.92,male,1
5,"Anderson, Mr Harry",1st,47.00,male,1
6,"Andrews, Miss Kornelia Theodosia",1st,63.00,female,1

In [36]:
# Finding if there are null values 
data.isnull().sum()

Name          0
PClass        1
Age         557
Sex           0
Survived      0
dtype: int64

In [37]:
# Observing mean and median of Age column 
print(data.Age.mean())
print(data.Age.median())

30.397989417989415
28.0

In [38]:
# Filling Null Values of Age column with median 
data.Age.fillna(data.Age.median(),inplace = True)

In [39]:
data.isnull().sum()

Name        0
PClass      1
Age         0
Sex         0
Survived    0
dtype: int64

In [40]:
# Droping the column which Has Null value for PClass 
data.dropna(axis = 0, how = 'any', inplace = True)

In [41]:
data.isnull().sum()

Name        0
PClass      0
Age         0
Sex         0
Survived    0
dtype: int64

In [42]:
data.shape

(1312, 5)

In [43]:
data.head(10)

,Name,PClass,Age,Sex,Survived
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0
4,"Allison, Master Hudson Trevor",1st,0.92,male,1
5,"Anderson, Mr Harry",1st,47.00,male,1
6,"Andrews, Miss Kornelia Theodosia",1st,63.00,female,1
7,"Andrews, Mr Thomas, jr",1st,39.00,male,0
8,"Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.00,female,1
9,"Artagaveytia, Mr Ramon",1st,71.00,male,0

In [44]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1312 entries, 0 to 1312
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      1312 non-null   object
 1   PClass    1312 non-null   object
 2   Age       1312 non-null   float64
 3   Sex       1312 non-null   object
 4   Survived  1312 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 61.5+ KB

**Stratified**

In [45]:
data['PClass'].value_counts()

3rd    711
1st    322
2nd    279
Name: PClass, dtype: int64

In [46]:
# Sampling 2 passengers from each PClass randomly 
df1 = data.groupby('PClass', group_keys = False).apply(lambda x: x.sample(262))

In [47]:
df1['PClass'].value_counts()

1st    262
2nd    262
3rd    262
Name: PClass, dtype: int64

In [48]:
df2 = data.groupby('PClass', group_keys=False).apply(lambda x: x.sample(frac=0.6))

In [49]:
df2['PClass'].value_counts()

3rd    427
1st    193
2nd    167
Name: PClass, dtype: int64

**Clustering**

In [50]:
age_Class = np.arange(0,100,10)
age_Class_labels = [f"{i} - {i+10}" for i in range(0,90,10)]
data['Age_Class'] = pd.cut(data['Age'], bins=age_Class, labels=age_Class_labels)
data['Age_Class'].value_counts()

20 - 30    816
30 - 40    150
10 - 20    117
40 - 50    104
0 - 10      55
50 - 60     48
60 - 70     19
70 - 80      3
80 - 90      0
Name: Age_Class, dtype: int64

In [51]:
# Displaying 4 groups of 9 
clusters = np.random.choice(list(data.Age_Class.unique()), size=4, replace=False)

In [52]:
cluster_sample = data[data['Age_Class'].isin(clusters)]
cluster_sample

,Name,PClass,Age,Sex,Survived,Age_Class
5,"Anderson, Mr Harry",1st,47.0,male,1,40 - 50
6,"Andrews, Miss Kornelia Theodosia",1st,63.0,female,1,60 - 70
9,"Artagaveytia, Mr Ramon",1st,71.0,male,0,70 - 80
10,"Astor, Colonel John Jacob",1st,47.0,male,0,40 - 50
11,"Astor, Mrs John Jacob (Madeleine Talmadge Force)",1st,19.0,female,1,10 - 20
...,...,...,...,...,...,...
1282,"Vereruysse, Mr Victor",3rd,47.0,male,0,40 - 50
1283,"Vestrom, Miss Hulda Amanda Adolfi",3rd,14.0,female,0,10 - 20
1292,"Wiklund, Mr Jacob Alfred",3rd,18.0,male,0,10 - 20
1293,"Wilkes, Mrs Ellen",3rd,45.0,female,1,40 - 50
1304,"Yasbeck, Mrs Antoni",3rd,15.0,female,1,10 - 20

In [53]:
# Counting the number of Observations from each group 
cluster_sample['Age_Class'].value_counts()

10 - 20    117
40 - 50    104
60 - 70     19
70 - 80      3
0 - 10       0
20 - 30      0
30 - 40      0
50 - 60      0
80 - 90      0
Name: Age_Class, dtype: int64